PolderLabsVOF/TimeTone/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TLS_USE_SECURE_ELEMENT=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_BUTTONMATRIX=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_SPINNER=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y


# Phase 1 of the TimeTone port. Design type sizes are 11/12/13/14/15px; LVGL
# ships discrete Montserrat sizes, so we add 12 (for the 11/12/13 role) and 16
# (for the 15px role). 14 is already enabled below. Bold is approximated by
# the accent background (LVGL's bundled Montserrat has no bold variant).
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
